package Lecture2_ControlOperators;

public class HomeWork_3 {
    public static void main(String[] args) {
//        Составьте программу, выводящую на экран квадраты чисел от 10 до 20
//        включительно.
        for (int i = 10; i <= 20; i++) {
            int result = i * i;
            System.out.println(result);
        }
    }
}
