package Lecture1_Intro;

public class HomeWork_4 {

    public static void main(String[] args) {

//        В переменной n хранится вещественное число с ненулевой дробной частью.
//        Создайте программу, которая округляет число n до ближайшего целого и
//        выводящую результат на экран.

        double n = 15.9561;
        double result = Math.round(n);

        System.out.println(result);

    }
}
