package Lecture1_Intro;

public class HomeWork_1 {

    public static void main(String[] args) {

//        Написать приложение, которое будет вычислять и выводить значение по
//        формуле: a=4*(b+c-1)/2;
//        b и c задаем в коде самостоятельно.

        int b = 5;
        int c = 7;
        int a = 4 * (b + c - 1) / 2;

        System.out.println(a);

    }
}
